Revit 2027 API
AnalyticalSupportPriority Enumeration
 Defines how "highly" another Element is giving support for one Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalyticalSupportPriority
Public Enumeration AnalyticalSupportPriority
public enum class AnalyticalSupportPriority
type AnalyticalSupportPriority
Members
Member name | Value | Description
FourthHigestPriority | 4
HighestPriority | 1
SecondHighestPriority | 2
ThirdHighestPriority | 3
UnknownPriority | 0 |  Priority has not been determined.
Remarks
 For instance, a Column may be a higher priority for a Beam than another Beam. This is useful to find the best supports for a given Element.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace